package org.example.basics.constructions;

/**
 * <p>Класс <b>SimpleCalculatorWithSwitchOperator</b> демонстрирует работу оператора Switch в Java, используя переменную типа Char.
 * Этот класс представляет собой простой консольный калькулятор, способный выполнять основные арифметические операции
 * такие как сложение, вычитание, умножение и деление.</p>
 *
 * <p>Класс использует класс Scanner для считывания входных данных от пользователя, включая два числа и выбор операции.
 * Оператор Switch используется для выбора арифметической операции на основе введённого символа операции.
 * Реализация включает в себя обработку исключительных ситуаций, таких как деление на ноль и ввод недопустимой операции.</p>
 *
 * <p>Данный пример иллюстрирует использование оператора Switch для упрощения кода при работе с множественными условиями,
 * а также подчеркивает важность обработки исключений в пользовательских вводах.</p>
 */
public class SimpleCalculatorWithSwitchOperator {
}